PANDAS FINAL

In [1]:
import pandas as pd

In [2]:
a=pd.Series([1,2,3,4])

In [3]:
a

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
b=pd.Series([22,34,45,67])

In [5]:
b

0    22
1    34
2    45
3    67
dtype: int64

In [6]:
c=pd.Series([1,2,3,4],index=[10,20,30,40],dtype='int32')

In [7]:
c

10    1
20    2
30    3
40    4
dtype: int32

In [9]:
s = pd.Series([1,2,3,4],index=[22,56,45,36],dtype='float32')

In [10]:
s

22    1.0
56    2.0
45    3.0
36    4.0
dtype: float32

In [11]:
s = pd.Series([1,2,3,4])
print(s[0])

1

In [12]:
s[3]

4

In [13]:
s = pd.Series([1,2,3,4])
print(s[0:3])

0    1
1    2
2    3
dtype: int64

In [14]:
import numpy as np
data=np.array([1,2,3,4])
m=pd.Series(data)
m

0    1
1    2
2    3
3    4
dtype: int32

In [15]:
demodict={'name':'X','age':12}
s1=pd.Series(demodict)
s1

name     X
age     12
dtype: object

In [16]:
ckr={'name':'vir','runs':23,'innings':3,'balls':23}
ckr

{'name': 'vir', 'runs': 23, 'innings': 3, 'balls': 23}

In [17]:
s2=pd.Series(ckr)

In [18]:
s2

name       vir
runs        23
innings      3
balls       23
dtype: object

In [22]:
import pandas as pd
data=[1,2,3,4]
df=pd.DataFrame(data,columns=['nos'])
df

   nos
0    1
1    2
2    3
3    4

In [20]:
data=[['Alex',10],['Bob',12],['clarke',13]]
df=pd.DataFrame(data)
df

        0   1
0    Alex  10
1     Bob  12
2  clarke  13

In [23]:
data=[['Alex',10],['Bob',12],['clarke',13]]
df=pd.DataFrame(data,columns=['name','age'])
df

     name  age
0    Alex   10
1     Bob   12
2  clarke   13

In [26]:
data=[['Alex',10],['Bob',12],['clarke',13]]
df=pd.DataFrame(data,columns=['name','age'],dtype='float32')
df

C:\Users\Inayat\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3444: FutureWarning: Could not cast to float32, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  exec(code_obj, self.user_global_ns, self.user_ns)

     name   age
0    Alex  10.0
1     Bob  12.0
2  clarke  13.0

In [27]:
data=[['Alex',10],['Bob',12],['clarke',13]]
df=pd.DataFrame(data,columns=['name','age'],dtype=float)
print(df)

     name   age
0    Alex  10.0
1     Bob  12.0
2  clarke  13.0

C:\Users\Inayat\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3444: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  exec(code_obj, self.user_global_ns, self.user_ns)

In [28]:
data={'name':['tom','jac','ste','ric'],'Age':[21,45,56,78]}
df=pd.DataFrame(data)
df

  name  Age
0  tom   21
1  jac   45
2  ste   56
3  ric   78

In [29]:
data=[{'a':1,'b':2},{'a':5,'b':6,'c':21}]
df=pd.DataFrame(data,dtype=float)
df

     a    b     c
0  1.0  2.0   NaN
1  5.0  6.0  21.0

In [1]:
import pandas as pd
import numpy as np
df=pd.DataFrame(np.random.randn(8,4),columns=['A','B','C','D'])
df

          A         B         C         D
0 -0.545642  0.985347 -0.162515 -0.368866
1  0.830126  0.024166  0.435067  0.154734
2 -1.563677  0.331171  0.480758  0.577488
3 -0.255287 -0.254886 -0.962254  1.715077
4 -1.879881 -0.073642  0.249539 -0.382166
5 -1.819692 -1.153854 -0.337915  0.658645
6 -0.942898  0.900662 -0.915055  0.916782
7 -0.640218  0.294056 -0.040102  0.232158

In [2]:
print(df.loc[:,'A'])

0   -0.545642
1    0.830126
2   -1.563677
3   -0.255287
4   -1.879881
5   -1.819692
6   -0.942898
7   -0.640218
Name: A, dtype: float64

In [12]:
print(df.loc[:'D'])

          A         B         C         D
0 -0.545642  0.985347 -0.162515 -0.368866
1  0.830126  0.024166  0.435067  0.154734
2 -1.563677  0.331171  0.480758  0.577488
3 -0.255287 -0.254886 -0.962254  1.715077
4 -1.879881 -0.073642  0.249539 -0.382166
5 -1.819692 -1.153854 -0.337915  0.658645
6 -0.942898  0.900662 -0.915055  0.916782
7 -0.640218  0.294056 -0.040102  0.232158

In [14]:
print(df.iloc[:4,:])

          A         B         C         D
0 -0.545642  0.985347 -0.162515 -0.368866
1  0.830126  0.024166  0.435067  0.154734
2 -1.563677  0.331171  0.480758  0.577488
3 -0.255287 -0.254886 -0.962254  1.715077

In [8]:
print(df.loc[:,['B','C']])

          B         C
0  0.985347 -0.162515
1  0.024166  0.435067
2  0.331171  0.480758
3 -0.254886 -0.962254
4 -0.073642  0.249539
5 -1.153854 -0.337915
6  0.900662 -0.915055
7  0.294056 -0.040102

In [20]:
print(df.iloc[:4,1])

0    0.985347
1    0.024166
2    0.331171
3   -0.254886
Name: B, dtype: float64

In [31]:
print(df.iloc[:8,:])

          A         B         C         D
0 -0.545642  0.985347 -0.162515 -0.368866
1  0.830126  0.024166  0.435067  0.154734
2 -1.563677  0.331171  0.480758  0.577488
3 -0.255287 -0.254886 -0.962254  1.715077
4 -1.879881 -0.073642  0.249539 -0.382166
5 -1.819692 -1.153854 -0.337915  0.658645
6 -0.942898  0.900662 -0.915055  0.916782
7 -0.640218  0.294056 -0.040102  0.232158

In [33]:
print(df.iloc[:,0])

0   -0.545642
1    0.830126
2   -1.563677
3   -0.255287
4   -1.879881
5   -1.819692
6   -0.942898
7   -0.640218
Name: A, dtype: float64

In [40]:
print(df.loc[:'D'])

          A         B         C         D
0 -0.545642  0.985347 -0.162515 -0.368866
1  0.830126  0.024166  0.435067  0.154734
2 -1.563677  0.331171  0.480758  0.577488
3 -0.255287 -0.254886 -0.962254  1.715077
4 -1.879881 -0.073642  0.249539 -0.382166
5 -1.819692 -1.153854 -0.337915  0.658645
6 -0.942898  0.900662 -0.915055  0.916782
7 -0.640218  0.294056 -0.040102  0.232158

In [44]:
print(df.iloc[1:4,0])

1    0.830126
2   -1.563677
3   -0.255287
Name: A, dtype: float64

In [54]:
print(df.iloc[1:8,0:4])

          A         B         C         D
1  0.830126  0.024166  0.435067  0.154734
2 -1.563677  0.331171  0.480758  0.577488
3 -0.255287 -0.254886 -0.962254  1.715077
4 -1.879881 -0.073642  0.249539 -0.382166
5 -1.819692 -1.153854 -0.337915  0.658645
6 -0.942898  0.900662 -0.915055  0.916782
7 -0.640218  0.294056 -0.040102  0.232158

In [55]:
print(df.iloc[1:3,1:4])

          B         C         D
1  0.024166  0.435067  0.154734
2  0.331171  0.480758  0.577488

In [56]:
print(df.iloc[:,1:4])

          B         C         D
0  0.985347 -0.162515 -0.368866
1  0.024166  0.435067  0.154734
2  0.331171  0.480758  0.577488
3 -0.254886 -0.962254  1.715077
4 -0.073642  0.249539 -0.382166
5 -1.153854 -0.337915  0.658645
6  0.900662 -0.915055  0.916782
7  0.294056 -0.040102  0.232158

In [57]:
print(df.iloc[1:3,:])

          A         B         C         D
1  0.830126  0.024166  0.435067  0.154734
2 -1.563677  0.331171  0.480758  0.577488

In [59]:
print(df.iloc[2:3,-1])

2    0.577488
Name: D, dtype: float64

In [60]:
print(df.iloc[:,-4:-2])

          A         B
0 -0.545642  0.985347
1  0.830126  0.024166
2 -1.563677  0.331171
3 -0.255287 -0.254886
4 -1.879881 -0.073642
5 -1.819692 -1.153854
6 -0.942898  0.900662
7 -0.640218  0.294056